## ANOVA Test(analysis of variance) or F test

In [1]:
import numpy as np
import seaborn as sns
from scipy.stats import f_oneway

In [17]:
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [18]:
df = df[["age", "pclass"]].dropna()

In [19]:
df

      age  pclass
0    22.0       3
1    38.0       1
2    26.0       3
3    35.0       1
4    35.0       3
..    ...     ...
885  39.0       3
886  27.0       2
887  19.0       1
889  26.0       1
890  32.0       3

[714 rows x 2 columns]

In [20]:
df["pclass"].unique()

array([3, 1, 2])

In [21]:
class1 = df[df["pclass"]==1]["age"]
class2 = df[df["pclass"]==2]["age"]
class3 = df[df["pclass"]==3]["age"]

In [23]:
f_stats, p_value = f_oneway(class1,class2, class3)
f_stats

np.float64(57.4434843406762)

In [24]:
significance_value = 0.05

In [ ]:
if p_value > significance_value:
    print("we accept the null hypothesis. And there is no signifiant difference.")
else:
    print("We reject the null hypothesis , and there is significant difference in at least one passenger class.")

We reject teh null hypothesis , and there is significant difference in atleast one passendger class.